#pragma once
//=============================================================================
//
// [offScreenRender.h]
// Author : 
//
//=============================================================================
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

struct OffSCREEN_CBUFFER
{
	int			mode;
	int			padding[3];
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitOffScreenRender(void);
void UninitOffScreenRender(void);

void DrawOffScreenRender(void);
void SetOffScreenRender(void);
void SetOffScreenModeBuffer(int);


